session5/cours/Spring-Security-OAuth2.org
#+TITLE: Notions de sécurité avec Spring Security, mise en œuvre de OAuth2
#+Author: Bernard Hugueney
#+DATE:

#+LANGUAGE: fr
#+LATEX_HEADER: \usepackage[AUTO]{babel}

#+LaTeX_HEADER: \addtolength{\oddsidemargin}{-.475in}
#+LaTeX_HEADER:	\addtolength{\evensidemargin}{-.475in}
#+LaTeX_HEADER:	\addtolength{\textwidth}{1.75in}
#+LaTeX_HEADER:
#+LaTeX_HEADER:	\addtolength{\topmargin}{-1.75in}
#+LaTeX_HEADER:	\addtolength{\textheight}{2.75in}
#+LaTeX_HEADER: \usepackage{comment}

#+BEGIN_SRC elisp :exports none :results silent
(setq org-plantuml-jar-path "/usr/share/plantuml/plantuml.jar")
(org-babel-do-load-languages 'org-babel-load-languages '((ditaa . t)(plantuml . t))) 
  (add-to-list 'org-latex-packages-alist '("" "listings"))
  (add-to-list 'org-latex-packages-alist '("" "color"))
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted)

  (setq org-latex-pdf-process '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                                "bibtex %b"
                                "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                                "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  (setq org-latex-minted-options '(("frame" "lines")
                                   ("fontsize" "\\scriptsize")
                                   ("xleftmargin" "\\parindent")
                                   ("linenos" "")))
#+END_SRC



* Notions de sécurité
** Modélisation de la menace (Threat Model)
La première étape d'une démarche de sécurisation est la [[https://en.wikipedia.org/wiki/Threat_model][modélisation
de la menace]]. En effet, selon que vous soyez chargé de protéger les
secrets nucléaires Français contre la NSA, le GRU et le MSS, ou que
vous ayez à protéger les résultats sportifs de votre association
locale de tennis de table, les enjeux ne seront pas les mêmes.  Il
faut donc identifier ce que vous avez à protéger, qui serait intéressé
à chercher un accès non autorisé et quel point.

** Difficultés de la sécurisation

On pourrait penser que la sécurisation n'est qu'une partie des
spécifications comme les autres et qu'il suffit que son implémentation
ne soit pas buggée pour que l'application soit sécurisée.

La différence fondamentale réside dans la classe des bugs à
éradiquer. Alors que dans le cadre d'une utilisation normale,
l'utilisateur ne rencontrera des bugs qu'accidentellement, un
utilisateur hostile recherchera activement des bugs à exploiter.

Pour cette raison, il est essentiel d'être particulièrement vigilant
quand à la qualité du code. Non seulement il faut éviter de
"réinventer la roue" soi-même, mais il ne faut pas se fier à n'importe
quel conseil [[https://blog.acolyer.org/2018/06/27/secure-coding-practices-in-java-challenges-and-vulnerabilities/][trouvé sur internet]].

** Sécurisation d'une application : Authentification  et Autorisation

On distingue généralement l'[[https://en.wikipedia.org/wiki/Electronic_authentication][authentification]] et
l'[[https://en.wikipedia.org/wiki/Authorization][autorisation]]. L'authentification consiste à l'assurer de l'identité
de l'utilisateur, et l'autorisation consiste à déterminer les droits
d'accès associés à l'utilisateur en fonction de son identité et plus
précisément en fonction des rôles (cf. cas d'utilisation) associés
cette identité.

** Spécificité des technologies web
Dans le cadre d'un système client-serveur où le client est un
navigateur web, il est essentiel de réaliser que l'on a aucun contrôle
sur le code exécuté par le client et donc sur les requêtes que
celui-ci envoie au serveur. *Par défaut*, on peut supposer que
l'utilisateur se contentera d'envoyer les requêtes prévues lors de la
conception du client. Cependant, l'utilisateur garde la possibilité
d'exécuter le code de son choix, notamment par la console
javascript. Pour cette raison, toutes les validations et restrictions
seront au moins implémentées côté serveur. On peut en implémenter côté
client pour permettre un retour plus rapide (sans attendre
d'aller-retour sur le réseau), mais on ne se contentera *jamais* d'une
vérification côté client.

Aussi, toute implémentation réelle devra *évidemment* utiliser SSL
pour *toutes* les communications, voire avec en plus du /certificate
pinning/ (ou [[https://fr.wikipedia.org/wiki/HTTP_Public_Key_Pinning][HTTP Public Key Pinning]]), même s'il [[https://news.ycombinator.com/item?id=15572143][y a des soucis qui
ont amené Chrome à ne plus le supporter]] et que d'[[https://en.wikipedia.org/wiki/Certificate_Transparency][autres solutions sont
explorées]].


