session5/cours/Spring-Security-OAuth2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2020-02-04 Tue 08:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notions de sécurité avec Spring Security, mise en œuvre de OAuth2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bernard Hugueney" />
</head>
<body>
<div id="content">
<h1 class="title">Notions de sécurité avec Spring Security, mise en œuvre de OAuth2</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9b43be6">1. Notions de sécurité</a>
<ul>
<li><a href="#org7c6ac7c">1.1. Modélisation de la menace (Threat Model)</a></li>
<li><a href="#org9e78b34">1.2. Difficultés de la sécurisation</a></li>
<li><a href="#orgf8cc5bb">1.3. Sécurisation d'une application : Authentification  et Autorisation</a></li>
<li><a href="#orge45480a">1.4. Spécificité des technologies web</a></li>
</ul>
</li>
<li><a href="#org2e57e6a">2. Authentification</a>
<ul>
<li><a href="#org6da7540">2.1. Authentification locale</a></li>
<li><a href="#org2a07b81">2.2. Authentification externalisée</a></li>
<li><a href="#org8772b84">2.3. Page d'accueil et contrôleur</a></li>
<li><a href="#org8c7ecb2">2.4. Protection basée sur les URL</a></li>
<li><a href="#org4867121">2.5. OAuth2</a></li>
<li><a href="#org7ce8066">2.6. Ajout de javascript côté client</a></li>
<li><a href="#orgabd58d9">2.7. Extraction d'informations sur l'utilisateur connecté</a></li>
<li><a href="#orgb7ca113">2.8. Logout</a></li>
<li><a href="#org2bc9833">2.9. CSRF</a></li>
<li><a href="#orgdb83a81">2.10. Sécurisation au niveau des méthodes</a></li>
<li><a href="#org1c90c54">2.11. Affectation de rôles en fonction d'information depuis le serveur OAuth 2.0</a></li>
</ul>
</li>
<li><a href="#org7108f5d">3. Mise en œuvre</a>
<ul>
<li><a href="#org3e0b1d1">3.1. Protections plus complexes au niveau des méthodes</a></li>
<li><a href="#org9b68658">3.2. CRUD</a></li>
<li><a href="#org1b1b35e">3.3. Client Angular 6</a></li>
</ul>
</li>
<li><a href="#org06b48a2">4. Pour aller plus loin</a>
<ul>
<li><a href="#org9a09d50">4.1. Content Security Policy</a></li>
<li><a href="#org7fe7b5b">4.2. SSL</a></li>
<li><a href="#orga7cc6b9">4.3. OWASP</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9b43be6" class="outline-2">
<h2 id="org9b43be6"><span class="section-number-2">1</span> Notions de sécurité</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7c6ac7c" class="outline-3">
<h3 id="org7c6ac7c"><span class="section-number-3">1.1</span> Modélisation de la menace (Threat Model)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
La première étape d'une démarche de sécurisation est la <a href="https://en.wikipedia.org/wiki/Threat_model">modélisation
de la menace</a>. En effet, selon que vous soyez chargé de protéger les
secrets nucléaires Français contre la NSA, le GRU et le MSS, ou que
vous ayez à protéger les résultats sportifs de votre association
locale de tennis de table, les enjeux ne seront pas les mêmes.  Il
faut donc identifier ce que vous avez à protéger, qui serait intéressé
à chercher un accès non autorisé et quel point.
</p>
</div>
</div>

<div id="outline-container-org9e78b34" class="outline-3">
<h3 id="org9e78b34"><span class="section-number-3">1.2</span> Difficultés de la sécurisation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
On pourrait penser que la sécurisation n'est qu'une partie des
spécifications comme les autres et qu'il suffit que son implémentation
ne soit pas buggée pour que l'application soit sécurisée.
</p>

<p>
La différence fondamentale réside dans la classe des bugs à
éradiquer. Alors que dans le cadre d'une utilisation normale,
l'utilisateur ne rencontrera des bugs qu'accidentellement, un
utilisateur hostile recherchera activement des bugs à exploiter.
</p>

<p>
Pour cette raison, il est essentiel d'être particulièrement vigilant
quand à la qualité du code. Non seulement il faut éviter de
"réinventer la roue" soi-même, mais il ne faut pas se fier à n'importe
quel conseil <a href="https://blog.acolyer.org/2018/06/27/secure-coding-practices-in-java-challenges-and-vulnerabilities/">trouvé sur internet</a>.
</p>
</div>
</div>

<div id="outline-container-orgf8cc5bb" class="outline-3">
<h3 id="orgf8cc5bb"><span class="section-number-3">1.3</span> Sécurisation d'une application : Authentification  et Autorisation</h3>
<div class="outline-text-3" id="text-1-3">
<p>
On distingue généralement l'<a href="https://en.wikipedia.org/wiki/Electronic_authentication">authentification</a> et
l'<a href="https://en.wikipedia.org/wiki/Authorization">autorisation</a>. L'authentification consiste à l'assurer de l'identité
de l'utilisateur, et l'autorisation consiste à déterminer les droits
d'accès associés à l'utilisateur en fonction de son identité et plus
précisément en fonction des rôles (cf. cas d'utilisation) associés
cette identité.
</p>
</div>
</div>

<div id="outline-container-orge45480a" class="outline-3">
<h3 id="orge45480a"><span class="section-number-3">1.4</span> Spécificité des technologies web</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Dans le cadre d'un système client-serveur où le client est un
navigateur web, il est essentiel de réaliser que l'on a aucun contrôle
sur le code exécuté par le client et donc sur les requêtes que
celui-ci envoie au serveur. <b>Par défaut</b>, on peut supposer que
l'utilisateur se contentera d'envoyer les requêtes prévues lors de la
conception du client. Cependant, l'utilisateur garde la possibilité
d'exécuter le code de son choix, notamment par la console
javascript. Pour cette raison, toutes les validations et restrictions
seront au moins implémentées côté serveur. On peut en implémenter côté
client pour permettre un retour plus rapide (sans attendre
d'aller-retour sur le réseau), mais on ne se contentera <b>jamais</b> d'une
vérification côté client.
</p>

<p>
Aussi, toute implémentation réelle devra <b>évidemment</b> utiliser SSL
pour <b>toutes</b> les communications, voire avec en plus du <i>certificate
pinning</i> (ou <a href="https://fr.wikipedia.org/wiki/HTTP_Public_Key_Pinning">HTTP Public Key Pinning</a>), même s'il <a href="https://news.ycombinator.com/item?id=15572143">y a des soucis qui
ont amené Chrome à ne plus le supporter</a> et que d'<a href="https://en.wikipedia.org/wiki/Certificate_Transparency">autres solutions sont
explorées</a>.
</p>
</div>
</div>
</div>
