session5/cours/Spring-Security-OAuth2.md
- [Notions de sécurité](#orgcfb3afd)
  - [Modélisation de la menace (Threat Model)](#orgd6496c4)
  - [Difficultés de la sécurisation](#orge405ebf)
  - [Sécurisation d'une application : Authentification  et Autorisation](#org0debcdc)
  - [Spécificité des technologies web](#org3c693e3)
- [Authentification](#org9d202d4)
  - [Authentification locale](#org0959026)
  - [Authentification externalisée](#orgfdf0211)
  - [Page d'accueil et contrôleur](#org8689510)
  - [Protection basée sur les URL](#org03d8164)
  - [OAuth2](#orgd172acf)
  - [Ajout de javascript côté client](#orgf7fc998)
  - [Extraction d'informations sur l'utilisateur connecté](#orgaedd41a)
  - [Logout](#orgacf2b71)
  - [CSRF](#orga7a92fa)
  - [Sécurisation au niveau des méthodes](#orgdb03f60)
  - [Affectation de rôles en fonction d'information depuis le serveur OAuth 2.0](#orgaa51572)
- [Mise en œuvre](#org9247620)
  - [Protections plus complexes au niveau des méthodes](#orga48ffd0)
  - [CRUD](#org276466a)
  - [Client Angular 6](#orgd2fa4a1)
- [Pour aller plus loin](#orgdf8dbe2)
  - [Content Security Policy](#org118a271)
  - [SSL](#org00c2469)
  - [OWASP](#orgffef12b)



<a id="orgcfb3afd"></a>

# Notions de sécurité


<a id="orgd6496c4"></a>

## Modélisation de la menace (Threat Model)

La première étape d'une démarche de sécurisation est la [modélisation de la menace](https://en.wikipedia.org/wiki/Threat_model). En effet, selon que vous soyez chargé de protéger les secrets nucléaires Français contre la NSA, le GRU et le MSS, ou que vous ayez à protéger les résultats sportifs de votre association locale de tennis de table, les enjeux ne seront pas les mêmes. Il faut donc identifier ce que vous avez à protéger, qui serait intéressé à chercher un accès non autorisé et quel point.


<a id="orge405ebf"></a>

## Difficultés de la sécurisation

On pourrait penser que la sécurisation n'est qu'une partie des spécifications comme les autres et qu'il suffit que son implémentation ne soit pas buggée pour que l'application soit sécurisée.

La différence fondamentale réside dans la classe des bugs à éradiquer. Alors que dans le cadre d'une utilisation normale, l'utilisateur ne rencontrera des bugs qu'accidentellement, un utilisateur hostile recherchera activement des bugs à exploiter.

Pour cette raison, il est essentiel d'être particulièrement vigilant quand à la qualité du code. Non seulement il faut éviter de "réinventer la roue" soi-même, mais il ne faut pas se fier à n'importe quel conseil [trouvé sur internet](https://blog.acolyer.org/2018/06/27/secure-coding-practices-in-java-challenges-and-vulnerabilities/).


<a id="org0debcdc"></a>

## Sécurisation d'une application : Authentification  et Autorisation

On distingue généralement l'[authentification](https://en.wikipedia.org/wiki/Electronic_authentication) et l'[autorisation](https://en.wikipedia.org/wiki/Authorization). L'authentification consiste à l'assurer de l'identité de l'utilisateur, et l'autorisation consiste à déterminer les droits d'accès associés à l'utilisateur en fonction de son identité et plus précisément en fonction des rôles (cf. cas d'utilisation) associés cette identité.


<a id="org3c693e3"></a>

## Spécificité des technologies web

Dans le cadre d'un système client-serveur où le client est un navigateur web, il est essentiel de réaliser que l'on a aucun contrôle sur le code exécuté par le client et donc sur les requêtes que celui-ci envoie au serveur. **Par défaut**, on peut supposer que l'utilisateur se contentera d'envoyer les requêtes prévues lors de la conception du client. Cependant, l'utilisateur garde la possibilité d'exécuter le code de son choix, notamment par la console javascript. Pour cette raison, toutes les validations et restrictions seront au moins implémentées côté serveur. On peut en implémenter côté client pour permettre un retour plus rapide (sans attendre d'aller-retour sur le réseau), mais on ne se contentera **jamais** d'une vérification côté client.

Aussi, toute implémentation réelle devra **évidemment** utiliser SSL pour **toutes** les communications, voire avec en plus du *certificate pinning* (ou [HTTP Public Key Pinning](https://fr.wikipedia.org/wiki/HTTP_Public_Key_Pinning)), même s'il [y a des soucis qui ont amené Chrome à ne plus le supporter](https://news.ycombinator.com/item?id=15572143) et que d'[autres solutions sont explorées](https://en.wikipedia.org/wiki/Certificate_Transparency).
