session5/cours/Spring-Security-OAuth2.html


<div id="outline-container-org2e57e6a" class="outline-2">
<h2 id="org2e57e6a"><span class="section-number-2">2</span> Authentification</h2>
<div class="outline-text-2" id="text-2">
<p>
Pour l'authentification, on a principalement deux possibilités : une
gestion locale ou une gestion externalisée.
</p>
</div>

<div id="outline-container-org6da7540" class="outline-3">
<h3 id="org6da7540"><span class="section-number-3">2.1</span> Authentification locale</h3>
<div class="outline-text-3" id="text-2-1">
<p>
L'authentification est généralement basée sur des association de
login et mot de passe. Lors d'une requête de connections, le mot de
passe envoyé est validé ou non en fonction du mot de passe déclaré à
l'inscription (ou modifié ultérieurement).
</p>


<p>
Le mot de passe lui-même est considéré comme une information
confidentielle, notamment parce qu'il est souvent réutilisé pour des
authentifications dans différents systèmes. Pour cette raison, il ne
doit <b>jamais</b> être stocké en clair dans une base de données. On
<a href="https://o7planning.org/en/11705/create-a-login-application-with-spring-boot-spring-security-jpa#a13944416">utilisera un hachage</a>, par exemple avec <a href="https://docs.spring.io/spring-security/site/docs/4.2.4.RELEASE/apidocs/org/springframework/security/crypto/bcrypt/BCryptPasswordEncoder.html">BCryptPasswordEncoder</a>. La
fonction de hachage est telle qu'il suffit de comparer les résultats
de hachage au lieu de comparer les mots de passe :
</p>


<p>
\(
bcrypt(receivedPassword) = bcrypt(storedPassword) \\
\iff receivedPassword = storedPassword \)
</p>


<p>
 mais il serait impossible (ou prohibitivement coûteux) de retrouver
le mot de passe stocké \(storedPassword\) à partir de la valeur stockée
en base \(bcrypt(storedPassword)\).
</p>

<p>
La <a href="https://medium.com/@gustavo.ponce.ch/spring-boot-spring-mvc-spring-security-mysql-a5d8545d837d">simple implémentation d'une authentification locale</a> requiert
d'avoir des tables/repositories/services pour les entités représentant
les utilisateurs et pour leurs rôles. De plus, dans on contexte de
Système d'Informations interne, on ne voudra généralement pas avoir un
profil utilisateur par application. Pour ces raisons, on pourra
préférer externaliser l'authentification, notamment par un mécanisme
d'<a href="https://fr.wikipedia.org/wiki/Authentification_unique">Authentification unique</a> (SSO pour <i>Single Sign On</i>).
</p>
</div>
</div>


<div id="outline-container-org2a07b81" class="outline-3">
<h3 id="org2a07b81"><span class="section-number-3">2.2</span> Authentification externalisée</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://en.wikipedia.org/wiki/OAuth#OAuth_2.0">OAuth 2.0</a> est un protocole largement utilisé pour déléguer
l'authentification. On va utiliser son implémentation dans la version
la plus récente de spring boot. OAuth 2.0 permet non seulement
l'authentification, mais aussi l'autorisation concernant les services
directement offerts par le prestataire OAuth 2.0 (par exemple
d'accès/modification aux posts pour Facebook, aux dépôts git pour
github, etc.). On va utiliser Github comme prestataire OAuth 2.0 pour
les exercices suivants.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>Créer un nouveau projet Spring boot avec les
caractéristiques suivantes :
<dl class="org-dl">
<dt>package</dt><dd>co.simplon.oauth2</dd>
<dt>version de spring boot</dt><dd>2.2.4</dd>
<dt>dépendences</dt><dd><ul class="org-ul">
<li>Security</li>
<li>Web</li>
</ul></dd>
</dl></dd>

<dt>Exercice</dt><dd><p>
Ajouter les dépendances suivantes au projet :
</p>
<div class="org-src-container">
<pre class="src src-xml">    &lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
        &lt;<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;org.springframework.security.oauth&lt;/<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;
        &lt;<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;spring-security-oauth2&lt;/<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;
    &lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;

    &lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;org.springframework.security.oauth.boot&lt;/<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;spring-security-oauth2-autoconfigure&lt;/<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;
    &lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
</pre>
</div></dd>

<dt>Exercice</dt><dd>Configurer le port du serveur pour qu'il se lance
en écoutant sur le port 8090 (ce sera utile pour la
suite).</dd>
</dl>

<p>
Afin de pouvoir observer des traces des mécanismes de sécurité,
définir aussi les propriétés suivantes:
</p>
<div class="org-src-container">
<pre class="src src-properties">logging.level.org.springframework.security=DEBUG
logging.level.org.springframework.security.web.FilterChainProxy: DEBUG
</pre>
</div>
</div>
</div>
