session5/cours/Spring-Security-OAuth2.md


<a id="org9d202d4"></a>

# Authentification

Pour l'authentification, on a principalement deux possibilités : une gestion locale ou une gestion externalisée.


<a id="org0959026"></a>

## Authentification locale

L'authentification est généralement basée sur des association de login et mot de passe. Lors d'une requête de connections, le mot de passe envoyé est validé ou non en fonction du mot de passe déclaré à l'inscription (ou modifié ultérieurement).

Le mot de passe lui-même est considéré comme une information confidentielle, notamment parce qu'il est souvent réutilisé pour des authentifications dans différents systèmes. Pour cette raison, il ne doit **jamais** être stocké en clair dans une base de données. On [utilisera un hachage](https://o7planning.org/en/11705/create-a-login-application-with-spring-boot-spring-security-jpa#a13944416), par exemple avec [BCryptPasswordEncoder](https://docs.spring.io/spring-security/site/docs/4.2.4.RELEASE/apidocs/org/springframework/security/crypto/bcrypt/BCryptPasswordEncoder.html). La fonction de hachage est telle qu'il suffit de comparer les résultats de hachage au lieu de comparer les mots de passe :

\( bcrypt(receivedPassword) = bcrypt(storedPassword) \\ \iff receivedPassword = storedPassword \)

mais il serait impossible (ou prohibitivement coûteux) de retrouver le mot de passe stocké \(storedPassword\) à partir de la valeur stockée en base \(bcrypt(storedPassword)\).

La [simple implémentation d'une authentification locale](https://medium.com/@gustavo.ponce.ch/spring-boot-spring-mvc-spring-security-mysql-a5d8545d837d) requiert d'avoir des tables/repositories/services pour les entités représentant les utilisateurs et pour leurs rôles. De plus, dans on contexte de Système d'Informations interne, on ne voudra généralement pas avoir un profil utilisateur par application. Pour ces raisons, on pourra préférer externaliser l'authentification, notamment par un mécanisme d'[Authentification unique](https://fr.wikipedia.org/wiki/Authentification_unique) (SSO pour *Single Sign On*).


<a id="orgfdf0211"></a>

## Authentification externalisée

[OAuth 2.0](https://en.wikipedia.org/wiki/OAuth#OAuth_2.0) est un protocole largement utilisé pour déléguer l'authentification. On va utiliser son implémentation dans la version la plus récente de spring boot. OAuth 2.0 permet non seulement l'authentification, mais aussi l'autorisation concernant les services directement offerts par le prestataire OAuth 2.0 (par exemple d'accès/modification aux posts pour Facebook, aux dépôts git pour github, etc.). On va utiliser Github comme prestataire OAuth 2.0 pour les exercices suivants.

-   **Exercice:** Créer un nouveau projet Spring boot avec les caractéristiques suivantes :
    -   **package:** co.simplon.oauth2
    -   **version de spring boot:** 2.2.4
    -   **dépendences:** -   Security
        -   Web

-   **Exercice:** Ajouter les dépendances suivantes au projet :
    
    ```xml
        <dependency>
    	<groupId>org.springframework.security.oauth</groupId>
    	<artifactId>spring-security-oauth2</artifactId>
        </dependency>
    
        <dependency>
          <groupId>org.springframework.security.oauth.boot</groupId>
          <artifactId>spring-security-oauth2-autoconfigure</artifactId>
        </dependency>
    ```

-   **Exercice:** Configurer le port du serveur pour qu'il se lance en écoutant sur le port 8090 (ce sera utile pour la suite).

Afin de pouvoir observer des traces des mécanismes de sécurité, définir aussi les propriétés suivantes:

```properties
logging.level.org.springframework.security=DEBUG
logging.level.org.springframework.security.web.FilterChainProxy: DEBUG
```
