session5/cours/Spring-Security-OAuth2.org
** Page d'accueil et contrôleur
- Exercice ::
  - Créer une page index.html dans le répertoire =src/main/resources/static=
    #+BEGIN_SRC html
      <!doctype html>
      <html lang="en">
	<head>
	  <meta charset="utf-8" />
	  <title>Demo spring security OAuth2</title>
	</head>
	<body>
	  Welcome !
	</body>
      </html>
    #+END_SRC
  - Créer une classe annotée =@Controller= (voire =RestController=)
    avec un =RequestMapping= sur =/np/private= qui retourne la chaîne
    de caractères ="private"=.
  - Lancer le programme en regardant les logs.
  - Aller à l'adresse [[http://localhost:8090/]] en regardant quelles
    requêtes sont envoyées par le navigateur et quels cookies sont
    déposés.
  - À la page de login, se connecter avec login =user= et le mot de
    passe généré indiqué dans les logs.
  - Aller à [[http://localhost:8090/np/private/]]
  - Supprimer les cookies associés à ce site et recharger la page.

** Protection basée sur les URL

Créer la classe suivante :
#+BEGIN_SRC java
  package co.simplon.oauth2;

  import org.springframework.context.annotation.Configuration;
  import org.springframework.security.config.annotation.web.builders.HttpSecurity;
  import org.springframework.security.config.annotation.web.configuration.WebSecurityConfigurerAdapter;

  @Configuration
  public class SecurityConfiguration extends WebSecurityConfigurerAdapter{

      @Override

      protected void configure(HttpSecurity http) throws Exception {
	  http.antMatcher("/**").authorizeRequests()
	      .antMatchers("/","/login**", "/error**").permitAll()
	      .anyRequest().authenticated();
      }
  }
#+END_SRC

Cette classe, qui doit porter l'annotation =@Configuration= pour être
prise en compte dans la configuration de notre application, créer un
/filtre/ d'autorisation pour toutes les requêtes à partir de la racine
(=antMatcher("/**")=) tel que :
 1. les urls de la racine, celles situées sous =/login= et sous =/error= sont autorisées

 2. toutes les autres exigent d'êtres authentifié.


L'ordre des règles est important ! Dès qu'une requête active une règle
(dans l'ordre de leurs déclarations), c'est celle-ci qui est activée.

 - Exercice :: tester l'accès à la racine, puis  =/np/private=.
 - Exercice :: Même chose en intervertissant les deux règles.


- Important ! :: La formulation (/whitelisting/) qui consiste à
                 indiquer explicitement les page autorisées et
                 interdit par défaut tout le reste est
                 *essentielle*. En effet, en cas d'oubli (ou plus
                 exactement lors d'un oubli), les utilisateurs feront
                 un rapport de bug pour se plaindre de ne pas avoir
                 accès à une page alors que des adversaires ne se
                 plaindront pas d'avoir accès à une page qui devrait
                 être protégée !



Plusieurs classes peuvent ainsi être définies pour décomposer la
configuration de sécurisation des URL, mais seule la première règle
activée aura un effet. On peut indiquer l'ordre (en utilisant
l'annotation [[https://docs.spring.io/spring-framework/docs/current/javadoc-api/org/springframework/core/annotation/Order.html][@Order]] sur la classe) dans lequel les différentes classes
de configuration doivent être considérées. En pratique, on restreindra
souvent les différentes classes de configuration à des chemins
différents par l'appel initial à =antMatcher=.


