session5/cours/Spring-Security-OAuth2.html


<div id="outline-container-org8772b84" class="outline-3">
<h3 id="org8772b84"><span class="section-number-3">2.3</span> Page d'accueil et contrôleur</h3>
<div class="outline-text-3" id="text-2-3">
<dl class="org-dl">
<dt>Exercice</dt><dd><ul class="org-ul">
<li><p>
Créer une page index.html dans le répertoire <code>src/main/resources/static</code>
</p>
<div class="org-src-container">
<pre class="src src-html">      <span style="color: #008000;">&lt;!doctype html&gt;</span>
      &lt;<span style="color: #006699;">html</span> <span style="color: #BA36A5;">lang</span>=<span style="color: #008000;">"en"</span>&gt;
        &lt;<span style="color: #006699;">head</span>&gt;
          &lt;<span style="color: #006699;">meta</span> <span style="color: #BA36A5;">charset</span>=<span style="color: #008000;">"utf-8"</span> /&gt;
          &lt;<span style="color: #006699;">title</span>&gt;<span style="color: #000000; font-weight: bold; text-decoration: underline;">Demo spring security OAuth2</span>&lt;/<span style="color: #006699;">title</span>&gt;
        &lt;/<span style="color: #006699;">head</span>&gt;
        &lt;<span style="color: #006699;">body</span>&gt;
          Welcome !
        &lt;/<span style="color: #006699;">body</span>&gt;
      &lt;/<span style="color: #006699;">html</span>&gt;
</pre>
</div></li>
<li>Créer une classe annotée <code>@Controller</code> (voire <code>RestController</code>)
avec un <code>RequestMapping</code> sur <code>/np/private</code> qui retourne la chaîne
de caractères <code>"private"</code>.</li>
<li>Lancer le programme en regardant les logs.</li>
<li>Aller à l'adresse <a href="http://localhost:8090/">http://localhost:8090/</a> en regardant quelles
requêtes sont envoyées par le navigateur et quels cookies sont
déposés.</li>
<li>À la page de login, se connecter avec login <code>user</code> et le mot de
passe généré indiqué dans les logs.</li>
<li>Aller à <a href="http://localhost:8090/np/private/">http://localhost:8090/np/private/</a></li>
<li>Supprimer les cookies associés à ce site et recharger la page.</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-org8c7ecb2" class="outline-3">
<h3 id="org8c7ecb2"><span class="section-number-3">2.4</span> Protection basée sur les URL</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Créer la classe suivante :
</p>
<div class="org-src-container">
<pre class="src src-java">  <span style="color: #0000FF;">package</span> co.simplon.<span style="color: #D0372D;">oauth2</span>;

  <span style="color: #0000FF;">import</span> <span style="color: #D0372D;">org</span>.<span style="color: #D0372D;">springframework</span>.<span style="color: #D0372D;">context</span>.<span style="color: #D0372D;">annotation</span>.<span style="color: #6434A3;">Configuration</span>;
  <span style="color: #0000FF;">import</span> <span style="color: #D0372D;">org</span>.<span style="color: #D0372D;">springframework</span>.<span style="color: #D0372D;">security</span>.<span style="color: #D0372D;">config</span>.<span style="color: #D0372D;">annotation</span>.<span style="color: #D0372D;">web</span>.<span style="color: #D0372D;">builders</span>.<span style="color: #6434A3;">HttpSecurity</span>;
  <span style="color: #0000FF;">import</span> <span style="color: #D0372D;">org</span>.<span style="color: #D0372D;">springframework</span>.<span style="color: #D0372D;">security</span>.<span style="color: #D0372D;">config</span>.<span style="color: #D0372D;">annotation</span>.<span style="color: #D0372D;">web</span>.<span style="color: #D0372D;">configuration</span>.<span style="color: #6434A3;">WebSecurityConfigurerAdapter</span>;

  <span style="color: #D0372D;">@Configuration</span>
  <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">SecurityConfiguration</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">WebSecurityConfigurerAdapter</span>{

      <span style="color: #D0372D;">@Override</span>

      <span style="color: #0000FF;">protected</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">configure</span>(<span style="color: #6434A3;">HttpSecurity</span> <span style="color: #BA36A5;">http</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">Exception</span> {
          http.antMatcher(<span style="color: #008000;">"/**"</span>).authorizeRequests()
              .antMatchers(<span style="color: #008000;">"/"</span>,<span style="color: #008000;">"/login**"</span>, <span style="color: #008000;">"/error**"</span>).permitAll()
              .anyRequest().authenticated();
      }
  }
</pre>
</div>

<p>
Cette classe, qui doit porter l'annotation <code>@Configuration</code> pour être
prise en compte dans la configuration de notre application, créer un
<i>filtre</i> d'autorisation pour toutes les requêtes à partir de la racine
(<code>antMatcher("/**")</code>) tel que :
</p>
<ol class="org-ol">
<li>les urls de la racine, celles situées sous <code>/login</code> et sous <code>/error</code> sont autorisées</li>

<li>toutes les autres exigent d'êtres authentifié.</li>
</ol>


<p>
L'ordre des règles est important ! Dès qu'une requête active une règle
(dans l'ordre de leurs déclarations), c'est celle-ci qui est activée.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>tester l'accès à la racine, puis  <code>/np/private</code>.</dd>
<dt>Exercice</dt><dd>Même chose en intervertissant les deux règles.</dd>
</dl>


<dl class="org-dl">
<dt>Important !</dt><dd>La formulation (<i>whitelisting</i>) qui consiste à
indiquer explicitement les page autorisées et
interdit par défaut tout le reste est
<b>essentielle</b>. En effet, en cas d'oubli (ou plus
exactement lors d'un oubli), les utilisateurs feront
un rapport de bug pour se plaindre de ne pas avoir
accès à une page alors que des adversaires ne se
plaindront pas d'avoir accès à une page qui devrait
être protégée !</dd>
</dl>



<p>
Plusieurs classes peuvent ainsi être définies pour décomposer la
configuration de sécurisation des URL, mais seule la première règle
activée aura un effet. On peut indiquer l'ordre (en utilisant
l'annotation <a href="https://docs.spring.io/spring-framework/docs/current/javadoc-api/org/springframework/core/annotation/Order.html">@Order</a> sur la classe) dans lequel les différentes classes
de configuration doivent être considérées. En pratique, on restreindra
souvent les différentes classes de configuration à des chemins
différents par l'appel initial à <code>antMatcher</code>.
</p>
</div>
</div>
