session5/cours/Spring-Security-OAuth2.html


<div id="outline-container-org4867121" class="outline-3">
<h3 id="org4867121"><span class="section-number-3">2.5</span> OAuth2</h3>
<div class="outline-text-3" id="text-2-5">
<dl class="org-dl">
<dt>Exercice</dt><dd>Configurer les <a href="https://docs.spring.io/spring-boot/docs/current-SNAPSHOT/reference/htmlsingle/#boot-features-security-oauth2">propriétés OAuth2</a> propriétés suivantes :</dd>
</dl>

<div class="org-src-container">
<pre class="src src-properties">security.oauth2.client.client-id= 7045a59b0f0c7a9dac46
security.oauth2.client.client-secret= 583daf81b2a22782bc9172d7a5a392e2d70a6f62
security.oauth2.client.access-token-uri= https://github.com/login/oauth/access_token
security.oauth2.client.user-authorization-uri= https://github.com/login/oauth/authorize
security.oauth2.client.client-authentication-scheme= form
security.oauth2.resource.user-info-uri= https://api.github.com/user
</pre>
</div>


<p>
Le couple <code>client-id</code> / <code>client-secret</code> est celui qui identifie notre
application auprès du prestataire de service <code>OAuth2</code> (ici
Github). Une application <a href="https://developer.github.com/apps/building-oauth-apps/creating-an-oauth-app/">a été enregistrée</a> pour l'adresse
<code>localhost:8090</code> et le couple d'identifiant/secret a été attribué à
cette application. Comme le service gratuit est bridé, on pourra avoir
intérêt à en enregistrer une autre (avec l'url de la racine comme
callback).
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd><ul class="org-ul">
<li>Ajouter l'annotation <code>@EnableOAuth2Sso</code> à la classe
<code>SecurityConfiguration</code>.</li>
<li>Se déconnecter de github par exemple en allant sur
<a href="https://github.com/logout">https://github.com/logout</a>.</li>
<li>Aller sur la pages d'acceuil et sur <code>/np/private</code>.</li>
</ul></dd>
</dl>


<p>
Pour plus de convivialité, ajouter un lien dans la page d'accueil :
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"container unauthenticated"</span>&gt;
       &lt;<span style="color: #006699;">div</span>&gt;
            Login with Github: &lt;<span style="color: #006699;">a</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"/login"</span>&gt;click here&lt;/<span style="color: #006699;">a</span>&gt;
        &lt;/<span style="color: #006699;">div</span>&gt;
    &lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>

<dl class="org-dl">
<dt>Exercice</dt><dd>Observer les redirections lorsqu'on clique sur le lien
ajouté, notamment lorsqu'on efface les cookies associés
à <a href="http://localhost:8090">http://localhost:8090</a> et/ou à <a href="https://github.com">https://github.com</a>.</dd>
</dl>
</div>
</div>



<div id="outline-container-org7ce8066" class="outline-3">
<h3 id="org7ce8066"><span class="section-number-3">2.6</span> Ajout de javascript côté client</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Pour utiliser javascript côté client, on pourrait charger les
bibliothèques depuis un CDN, mais on peut aussi les héberger
directement sur notre serveur. Pour les plus répandues, il y a déjà
des dépendances maven.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>Ajouter les dépendances suivantes :</dd>
</dl>
<div class="org-src-container">
<pre class="src src-xml">  &lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;org.webjars&lt;/<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;js-cookie&lt;/<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;2.1.0&lt;/<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;
  &lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
  &lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;org.webjars&lt;/<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;jquery&lt;/<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;2.1.1&lt;/<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;
  &lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
  &lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;org.webjars&lt;/<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;bootstrap&lt;/<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;3.2.0&lt;/<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;
  &lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
  &lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;org.webjars&lt;/<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;webjars-locator-core&lt;/<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;
  &lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
</pre>
</div>
<dl class="org-dl">
<dt>Exercice</dt><dd>Modifier la page d'accueil pour inclure les
bibliothèques suivantes :</dd>
</dl>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #006699;">base</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"/"</span> /&gt;
&lt;<span style="color: #006699;">link</span> <span style="color: #BA36A5;">rel</span>=<span style="color: #008000;">"stylesheet"</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/css"</span>
    <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"/webjars/bootstrap/css/bootstrap.min.css"</span> /&gt;
&lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/javascript"</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"/webjars/jquery/jquery.min.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
&lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/javascript"</span>
    <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"/webjars/bootstrap/js/bootstrap.min.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;

</pre>
</div>

<dl class="org-dl">
<dt>Exercice</dt><dd>Modifier la configuration d sécurité pour permettre
l'accès aux fichiers javascripts et css.</dd>

<dt>Exercice</dt><dd>Modifier la page d'accueil pour indiquer le nom de la
personne connectée :</dd>
</dl>
<div class="org-src-container">
<pre class="src src-html">  &lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"container unauthenticated"</span>&gt;
    &lt;<span style="color: #006699;">div</span>&gt;
      Login with Github: &lt;<span style="color: #006699;">a</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"/login"</span>&gt;click here&lt;/<span style="color: #006699;">a</span>&gt;
    &lt;/<span style="color: #006699;">div</span>&gt;
  &lt;/<span style="color: #006699;">div</span>&gt;
  &lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"container authenticated"</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"display: none"</span>&gt;
    Logged in as: &lt;<span style="color: #006699;">span</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"user"</span>&gt;&lt;/<span style="color: #006699;">span</span>&gt;
  
  &lt;/<span style="color: #006699;">div</span>&gt;
</pre>
</div>
</div>
</div>
