session5/cours/Spring-Security-OAuth2.md


<a id="orgd172acf"></a>

## OAuth2

-   **Exercice:** Configurer les [propriétés OAuth2](https://docs.spring.io/spring-boot/docs/current-SNAPSHOT/reference/htmlsingle/#boot-features-security-oauth2) propriétés suivantes :

```properties
security.oauth2.client.client-id= 7045a59b0f0c7a9dac46
security.oauth2.client.client-secret= 583daf81b2a22782bc9172d7a5a392e2d70a6f62
security.oauth2.client.access-token-uri= https://github.com/login/oauth/access_token
security.oauth2.client.user-authorization-uri= https://github.com/login/oauth/authorize
security.oauth2.client.client-authentication-scheme= form
security.oauth2.resource.user-info-uri= https://api.github.com/user
```

Le couple `client-id` / `client-secret` est celui qui identifie notre application auprès du prestataire de service `OAuth2` (ici Github). Une application [a été enregistrée](https://developer.github.com/apps/building-oauth-apps/creating-an-oauth-app/) pour l'adresse `localhost:8090` et le couple d'identifiant/secret a été attribué à cette application. Comme le service gratuit est bridé, on pourra avoir intérêt à en enregistrer une autre (avec l'url de la racine comme callback).

-   **Exercice:** -   Ajouter l'annotation `@EnableOAuth2Sso` à la classe `SecurityConfiguration`.
    -   Se déconnecter de github par exemple en allant sur <https://github.com/logout>.
    -   Aller sur la pages d'acceuil et sur `/np/private`.

Pour plus de convivialité, ajouter un lien dans la page d'accueil :

```html
<div class="container unauthenticated">
       <div>
            Login with Github: <a href="/login">click here</a>
        </div>
    </div>
```

-   **Exercice:** Observer les redirections lorsqu'on clique sur le lien ajouté, notamment lorsqu'on efface les cookies associés à <http://localhost:8090> et/ou à <https://github.com>.


<a id="orgf7fc998"></a>

## Ajout de javascript côté client

Pour utiliser javascript côté client, on pourrait charger les bibliothèques depuis un CDN, mais on peut aussi les héberger directement sur notre serveur. Pour les plus répandues, il y a déjà des dépendances maven.

-   **Exercice:** Ajouter les dépendances suivantes :

```xml
  <dependency>
      <groupId>org.webjars</groupId>
      <artifactId>js-cookie</artifactId>
      <version>2.1.0</version>
  </dependency>
  <dependency>
      <groupId>org.webjars</groupId>
      <artifactId>jquery</artifactId>
      <version>2.1.1</version>
  </dependency>
  <dependency>
      <groupId>org.webjars</groupId>
      <artifactId>bootstrap</artifactId>
      <version>3.2.0</version>
  </dependency>
  <dependency>
      <groupId>org.webjars</groupId>
      <artifactId>webjars-locator-core</artifactId>
  </dependency>
```

-   **Exercice:** Modifier la page d'accueil pour inclure les bibliothèques suivantes :

```html
<base href="/" />
<link rel="stylesheet" type="text/css"
    href="/webjars/bootstrap/css/bootstrap.min.css" />
<script type="text/javascript" src="/webjars/jquery/jquery.min.js"></script>
<script type="text/javascript"
    src="/webjars/bootstrap/js/bootstrap.min.js"></script>

```

-   **Exercice:** Modifier la configuration d sécurité pour permettre l'accès aux fichiers javascripts et css.

-   **Exercice:** Modifier la page d'accueil pour indiquer le nom de la personne connectée :

```html
  <div class="container unauthenticated">
    <div>
      Login with Github: <a href="/login">click here</a>
    </div>
  </div>
  <div class="container authenticated" style="display: none">
    Logged in as: <span id="user"></span>
  
  </div>
```
