session5/cours/Spring-Security-OAuth2.html

<div id="outline-container-orgabd58d9" class="outline-3">
<h3 id="orgabd58d9"><span class="section-number-3">2.7</span> Extraction d'informations sur l'utilisateur connecté</h3>
<div class="outline-text-3" id="text-2-7">
<dl class="org-dl">
<dt>Exercice</dt><dd>Ajouter le code suivant à la page d'accueil :</dd>
</dl>
<div class="org-src-container">
<pre class="src src-html">  &lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/javascript"</span>&gt;
    $.get("/user", function(data) {
    $("#user").html(data.name);
    $(".unauthenticated").hide();
    $(".authenticated").show();
    });
  &lt;/<span style="color: #006699;">script</span>&gt;
</pre>
</div>


<p>
Pour implémenter la réponse à l'url <code>/user</code>, on va utiliser
l'interface <a href="https://docs.oracle.com/javase/7/docs/api/java/security/Principal.html">java.security.Principal</a>. Il suffit pour cela d'ajouter un
argument de type <a href="https://docs.oracle.com/javase/7/docs/api/java/security/Principal.html">java.security.Principal</a> à la méthode associée à l'url
<code>/user</code>. Dans le code javascript, on accède à un attribut nommé <code>name</code>
de la donnée reçu en réponse à la requête. Ce peut aussi bien être la
valeur associée à une clé <code>"name"</code> dans un dictionnaire.  Implémenter
dans le contrôler une méthode qui retourne (au format JSON) une
<code>Map&lt;String, String&gt;</code> associant la clé <code>"name"</code> au nom contenu dans
l'instance de <code>Principal</code> reçue en argument.
</p>

<p>
Si l'on avait voulou d'autres informations que celles fournies par
l'interface <a href="https://docs.oracle.com/javase/7/docs/api/java/security/Principal.html">java.security.Principal</a>, on aurait pu de la même façon
récupérer un argument de type <a href="https://docs.spring.io/spring-security/site/docs/4.2.x/apidocs/index.html?org/springframework/security/core/Authentication.html">Authentication</a> à la place.
</p>
</div>
</div>



<div id="outline-container-orgb7ca113" class="outline-3">
<h3 id="orgb7ca113"><span class="section-number-3">2.8</span> Logout</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Côté client, on va ajouter à la page d'accueil un bouton de
déconnection.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>Ajouter à la page d'acceuil un bouton qui exécute le
code javascript suivant :</dd>
</dl>
<div class="org-src-container">
<pre class="src src-javascript">  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">logout</span> = <span style="color: #0000FF;">function</span>() {
      $.post(<span style="color: #008000;">"/logout"</span>, <span style="color: #0000FF;">function</span>() {
          $(<span style="color: #008000;">"#user"</span>).html(<span style="color: #008000;">''</span>);
          $(<span style="color: #008000;">".unauthenticated"</span>).show();
          $(<span style="color: #008000;">".authenticated"</span>).hide();
      })
      <span style="color: #0000FF;">return</span> <span style="color: #D0372D;">true</span>;
  }
</pre>
</div>

<p>
Côté serveur, modifier la classe <code>SecurityConfiguration</code> pour ajouter
aux appels sur l'argument <code>HttpSecurity</code> de la méthode <code>configure</code> les appels suivants :
</p>
<div class="org-src-container">
<pre class="src src-java">.and().logout().logoutSuccessUrl(<span style="color: #008000;">"/"</span>).permitAll();
</pre>
</div>


<dl class="org-dl">
<dt>Exercice</dt><dd>Essayer de se connecter et de se déconnecter. Quel
problème y a-t-il à la déconnection ?</dd>
</dl>
</div>
</div>

<div id="outline-container-org2bc9833" class="outline-3">
<h3 id="org2bc9833"><span class="section-number-3">2.9</span> CSRF</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Les site <b>doivent</b> être protégés contre le <a href="https://fr.wikipedia.org/wiki/Cross-site_request_forgery">CSRF</a>, et c'est la raison
pour laquelle la requête de déconnection est refusée avec la
configuration de sécurité par défaut.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd><p>
Désactiver la protection contre csrf sur tout le site
avec les appels de méthodes suivants:
</p>
<div class="org-src-container">
<pre class="src src-java">              .csrf().disable()
</pre>
</div></dd>
</dl>

<p>
Évidemment, on voudra plutôt modifier notre client pour qu'il prenne
en compte la protection contre CSRF. C'est d'ailleurs pour cela qu'on
avait ajouté la dépendance à la bibliothèque javascript d'accès aux
cookies à notre projet.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd><p>
Ajouter la dépendance à la bibliothèque d'accès aux
cookies sur la page d'acceuil :
</p>
<div class="org-src-container">
<pre class="src src-html">                    &lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/javascript"</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"/webjars/js-cookie/js.cookie.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
</pre>
</div>
<p>
et ajouter l'exécution du code suivant :
</p>
<div class="org-src-container">
<pre class="src src-javascript">                 $.ajaxSetup({
                     <span style="color: #006699;">beforeSend</span> : <span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">xhr</span>, <span style="color: #BA36A5;">settings</span>) {
                         <span style="color: #0000FF;">if</span> (settings.type == <span style="color: #008000;">'POST'</span> || settings.type == <span style="color: #008000;">'PUT'</span>
                             || settings.type == <span style="color: #008000;">'DELETE'</span> || settings.type == <span style="color: #008000;">'GET'</span> ) {
                             <span style="color: #0000FF;">if</span> (!(<span style="color: #008000;">/^http:.*/</span>.test(settings.url) || <span style="color: #008000;">/^https:.*/</span>
                                   .test(settings.url))) {
                                 <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Only send the token to relative URLs i.e. locally.</span>
                                 xhr.setRequestHeader(<span style="color: #008000;">"X-XSRF-TOKEN"</span>, Cookies
                                                      .get(<span style="color: #008000;">'XSRF-TOKEN'</span>));
                                }
                         }
                     }
                 });
</pre>
</div>
<p>
Refaire un cycle de connection / déconnection en ayant
enlevé <code>.csrf().disable()</code> et en mettant
<code>.and().csrf().csrfTokenRepository(CookieCsrfTokenRepository.withHttpOnlyFalse())</code>
la place côté serveur et observer les requêtes,
notamment au niveau des entêtes.
</p></dd>
</dl>
</div>
</div>
