session5/cours/Spring-Security-OAuth2.md


<a id="orgaedd41a"></a>

## Extraction d'informations sur l'utilisateur connecté

-   **Exercice:** Ajouter le code suivant à la page d'accueil :

```html
  <script type="text/javascript">
    $.get("/user", function(data) {
    $("#user").html(data.name);
    $(".unauthenticated").hide();
    $(".authenticated").show();
    });
  </script>
```

Pour implémenter la réponse à l'url `/user`, on va utiliser l'interface [java.security.Principal](https://docs.oracle.com/javase/7/docs/api/java/security/Principal.html). Il suffit pour cela d'ajouter un argument de type [java.security.Principal](https://docs.oracle.com/javase/7/docs/api/java/security/Principal.html) à la méthode associée à l'url `/user`. Dans le code javascript, on accède à un attribut nommé `name` de la donnée reçu en réponse à la requête. Ce peut aussi bien être la valeur associée à une clé `"name"` dans un dictionnaire. Implémenter dans le contrôler une méthode qui retourne (au format JSON) une `Map<String, String>` associant la clé `"name"` au nom contenu dans l'instance de `Principal` reçue en argument.

Si l'on avait voulou d'autres informations que celles fournies par l'interface [java.security.Principal](https://docs.oracle.com/javase/7/docs/api/java/security/Principal.html), on aurait pu de la même façon récupérer un argument de type [Authentication](https://docs.spring.io/spring-security/site/docs/4.2.x/apidocs/index.html?org/springframework/security/core/Authentication.html) à la place.


<a id="orgacf2b71"></a>

## Logout

Côté client, on va ajouter à la page d'accueil un bouton de déconnection.

-   **Exercice:** Ajouter à la page d'acceuil un bouton qui exécute le code javascript suivant :

```javascript
  var logout = function() {
      $.post("/logout", function() {
	  $("#user").html('');
	  $(".unauthenticated").show();
	  $(".authenticated").hide();
      })
      return true;
  }
```

Côté serveur, modifier la classe `SecurityConfiguration` pour ajouter aux appels sur l'argument `HttpSecurity` de la méthode `configure` les appels suivants :

```java
.and().logout().logoutSuccessUrl("/").permitAll();
```

-   **Exercice:** Essayer de se connecter et de se déconnecter. Quel problème y a-t-il à la déconnection ?


<a id="orga7a92fa"></a>

## CSRF

Les site **doivent** être protégés contre le [CSRF](https://fr.wikipedia.org/wiki/Cross-site_request_forgery), et c'est la raison pour laquelle la requête de déconnection est refusée avec la configuration de sécurité par défaut.

-   **Exercice:** Désactiver la protection contre csrf sur tout le site avec les appels de méthodes suivants:
    
    ```java
    	      .csrf().disable()
    ```

Évidemment, on voudra plutôt modifier notre client pour qu'il prenne en compte la protection contre CSRF. C'est d'ailleurs pour cela qu'on avait ajouté la dépendance à la bibliothèque javascript d'accès aux cookies à notre projet.

-   **Exercice:** Ajouter la dépendance à la bibliothèque d'accès aux cookies sur la page d'acceuil :
    
    ```html
    		    <script type="text/javascript" src="/webjars/js-cookie/js.cookie.js"></script>
    ```
    
    et ajouter l'exécution du code suivant :
    
    ```javascript
    		 $.ajaxSetup({
    		     beforeSend : function(xhr, settings) {
    			 if (settings.type == 'POST' || settings.type == 'PUT'
    			     || settings.type == 'DELETE' || settings.type == 'GET' ) {
    			     if (!(/^http:.*/.test(settings.url) || /^https:.*/
    				   .test(settings.url))) {
    				 // Only send the token to relative URLs i.e. locally.
    				 xhr.setRequestHeader("X-XSRF-TOKEN", Cookies
    						      .get('XSRF-TOKEN'));
    				}
    			 }
    		     }
    		 });
    ```
    
    Refaire un cycle de connection / déconnection en ayant enlevé `.csrf().disable()` et en mettant `.and().csrf().csrfTokenRepository(CookieCsrfTokenRepository.withHttpOnlyFalse())` la place côté serveur et observer les requêtes, notamment au niveau des entêtes.
