session5/cours/Spring-Security-OAuth2.org
** Sécurisation au niveau des méthodes

On peut aussi définir des restrictions d'accès au niveau de méthodes,
par exemple au niveau des services. Pour cela il faut d'abord activer
cette possibilité avec l'annotation [[https://docs.spring.io/spring-security/site/docs/4.2.6.RELEASE/apidocs/org/springframework/security/config/annotation/method/configuration/EnableGlobalMethodSecurity.html][@EnableGlobalMethodSecurity]].

- Exercice :: 
  - Mettre l'annotation
    =@EnableGlobalMethodSecurity(securedEnabled = true)=
    sur la classe =SecurityConfiguration=.
  - Rendre accessible sans restriction toutes les url sous =/np= dans
    la méthode =configure(HttpSecurity)= de cette classe.
  - Dans un contrôleur, définir les méthodes suivantes :
    #+BEGIN_SRC java
    	@RequestMapping("/np/private")
	public String privateInfo() {
		return myService.privateInfo();
	}
	
	@RequestMapping("/np/admin")
	public String adminInfo() {
		return myService.adminInfo();
	}
	@RequestMapping("/np")
	public String np() {
		return myService.publicInfo();
	}
    #+END_SRC
    avec un attribut =MyService myService;= injecté.
  - Dans une classe =MyService= injectable, définir les méthodes
    suivantes :
    #+BEGIN_SRC java
      public String publicInfo() {
	  return "for anybody";
      }
      public String adminInfo() {
	  return "for admin only";
      }
      public String privateInfo() {
	  return "for user";
      }
    #+END_SRC
    et restreindre l'accès aux deux dernières aux rôles administrateur
    (=ROLE_ADMIN=) et utilisateur (=ROLE_USER=) grâce l'annotation
    [[https://docs.spring.io/spring-security/site/docs/4.2.4.RELEASE/apidocs/org/springframework/security/access/annotation/Secured.html][@Secured]].
  - Tester l'accès à ces URL.

