session5/cours/Spring-Security-OAuth2.html


<div id="outline-container-orgdb83a81" class="outline-3">
<h3 id="orgdb83a81"><span class="section-number-3">2.10</span> Sécurisation au niveau des méthodes</h3>
<div class="outline-text-3" id="text-2-10">
<p>
On peut aussi définir des restrictions d'accès au niveau de méthodes,
par exemple au niveau des services. Pour cela il faut d'abord activer
cette possibilité avec l'annotation <a href="https://docs.spring.io/spring-security/site/docs/4.2.6.RELEASE/apidocs/org/springframework/security/config/annotation/method/configuration/EnableGlobalMethodSecurity.html">@EnableGlobalMethodSecurity</a>.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd><ul class="org-ul">
<li>Mettre l'annotation
<code>@EnableGlobalMethodSecurity(securedEnabled = true)</code>
sur la classe <code>SecurityConfiguration</code>.</li>
<li>Rendre accessible sans restriction toutes les url sous <code>/np</code> dans
la méthode <code>configure(HttpSecurity)</code> de cette classe.</li>
<li><p>
Dans un contrôleur, définir les méthodes suivantes :
</p>
<div class="org-src-container">
<pre class="src src-java">        <span style="color: #D0372D;">@RequestMapping</span>(<span style="color: #008000;">"/np/private"</span>)
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">privateInfo</span>() {
                <span style="color: #0000FF;">return</span> myService.privateInfo();
        }
        
        <span style="color: #D0372D;">@RequestMapping</span>(<span style="color: #008000;">"/np/admin"</span>)
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">adminInfo</span>() {
                <span style="color: #0000FF;">return</span> myService.adminInfo();
        }
        <span style="color: #D0372D;">@RequestMapping</span>(<span style="color: #008000;">"/np"</span>)
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">np</span>() {
                <span style="color: #0000FF;">return</span> myService.publicInfo();
        }
</pre>
</div>
<p>
avec un attribut <code>MyService myService;</code> injecté.
</p></li>
<li><p>
Dans une classe <code>MyService</code> injectable, définir les méthodes
suivantes :
</p>
<div class="org-src-container">
<pre class="src src-java">      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">publicInfo</span>() {
          <span style="color: #0000FF;">return</span> <span style="color: #008000;">"for anybody"</span>;
      }
      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">adminInfo</span>() {
          <span style="color: #0000FF;">return</span> <span style="color: #008000;">"for admin only"</span>;
      }
      <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">privateInfo</span>() {
          <span style="color: #0000FF;">return</span> <span style="color: #008000;">"for user"</span>;
      }
</pre>
</div>
<p>
et restreindre l'accès aux deux dernières aux rôles administrateur
(<code>ROLE_ADMIN</code>) et utilisateur (<code>ROLE_USER</code>) grâce l'annotation
<a href="https://docs.spring.io/spring-security/site/docs/4.2.4.RELEASE/apidocs/org/springframework/security/access/annotation/Secured.html">@Secured</a>.
</p></li>
<li>Tester l'accès à ces URL.</li>
</ul></dd>
</dl>
</div>
</div>
