session5/cours/Spring-Security-OAuth2.org
** Affectation de rôles en fonction d'information depuis le serveur OAuth 2.0

On va donner à l'utilisateur le rôle d'administrateur s'il est membre,
*de façon publique*, de l'organisation =simplonco=.

- Exercice :: Ajouter les méthodes suivantes à la classe
              =SecurityConfiguration= :
	      #+BEGIN_SRC java
		@Bean
		public OAuth2RestTemplate oauth2RestTemplate(OAuth2ProtectedResourceDetails resource
							     , OAuth2ClientContext context) {
		    return new OAuth2RestTemplate(resource, context);
		}

		@Bean
		public AuthoritiesExtractor authoritiesExtractor(OAuth2RestOperations template) {
		    return new GithubOrgsAuthoritiesExtractor(template);
		}
	      #+END_SRC
	      L'annotation [[https://docs.spring.io/spring-javaconfig/docs/1.0.0.M4/reference/html/ch02s02.html][@Bean]] permet d'utiliser les objets
              retournés par ces méthodes pour de l'injection de
              dépendances. Il faut bien sûr aussi définir la classe
              =GithubOrgsAuthoritiesExtractor= :
	      #+BEGIN_SRC java
		class GithubOrgsAuthoritiesExtractor implements AuthoritiesExtractor{
	
		    private OAuth2RestOperations template;
	
		    GithubOrgsAuthoritiesExtractor(OAuth2RestOperations template){
			this.template= template;
		    }

		    @Override
		    public List<GrantedAuthority> extractAuthorities(Map<String, Object> map) {
			String url = (String) map.get("organizations_url");
			System.err.println("url:"+url);
			@SuppressWarnings("unchecked")
			    List<Map<String, Object>> orgs = template.getForObject(url, List.class);
			System.err.println("orgs:"+orgs);
			for(Map<String, Object> org : orgs) {
			    if("simplonco".equals(org.get("login"))) {
				return AuthorityUtils.commaSeparatedStringToAuthorityList("ROLE_USER, ROLE_ADMIN");
			    }
			}
			return AuthorityUtils.commaSeparatedStringToAuthorityList("ROLE_USER");
			//	throw new BadCredentialsException("Not in required organization");

		    }
		}
	      #+END_SRC
	      Tester l'accès à la ressource restreinte au rôle
              d'administrateur. Éventuellement, créer une autre
              organisation github, s'y inscrire et rendre publique
              son appartenance à celle-ci. Modifier le code pour
              qu'il utilise cette nouvelle organisation et tester
              nouveau.

* Mise en œuvre
** Protections plus complexes au niveau des méthodes
Tester les annotations [[http://www.baeldung.com/spring-security-method-security][@PreAuthorize et @PostAutorize]].
** CRUD
Implémenter la sécurisation d'un CRUD
