session5/cours/Spring-Security-OAuth2.html

<div id="outline-container-org1c90c54" class="outline-3">
<h3 id="org1c90c54"><span class="section-number-3">2.11</span> Affectation de rôles en fonction d'information depuis le serveur OAuth 2.0</h3>
<div class="outline-text-3" id="text-2-11">
<p>
On va donner à l'utilisateur le rôle d'administrateur s'il est membre,
<b>de façon publique</b>, de l'organisation <code>simplonco</code>.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd><p>
Ajouter les méthodes suivantes à la classe
<code>SecurityConfiguration</code> :
</p>
<div class="org-src-container">
<pre class="src src-java">                <span style="color: #D0372D;">@Bean</span>
                <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">OAuth2RestTemplate</span> <span style="color: #006699;">oauth2RestTemplate</span>(<span style="color: #6434A3;">OAuth2ProtectedResourceDetails</span> <span style="color: #BA36A5;">resource</span>
                                                             , <span style="color: #6434A3;">OAuth2ClientContext</span> <span style="color: #BA36A5;">context</span>) {
                    <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">OAuth2RestTemplate</span>(resource, context);
                }

                <span style="color: #D0372D;">@Bean</span>
                <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">AuthoritiesExtractor</span> <span style="color: #006699;">authoritiesExtractor</span>(<span style="color: #6434A3;">OAuth2RestOperations</span> <span style="color: #BA36A5;">template</span>) {
                    <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">GithubOrgsAuthoritiesExtractor</span>(template);
                }
</pre>
</div>
<p>
L'annotation <a href="https://docs.spring.io/spring-javaconfig/docs/1.0.0.M4/reference/html/ch02s02.html">@Bean</a> permet d'utiliser les objets
retournés par ces méthodes pour de l'injection de
dépendances. Il faut bien sûr aussi définir la classe
<code>GithubOrgsAuthoritiesExtractor</code> :
</p>
<div class="org-src-container">
<pre class="src src-java">                <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">GithubOrgsAuthoritiesExtractor</span> <span style="color: #0000FF;">implements</span> <span style="color: #6434A3;">AuthoritiesExtractor</span>{
        
                    <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">OAuth2RestOperations</span> <span style="color: #BA36A5;">template</span>;
        
                    <span style="color: #006699;">GithubOrgsAuthoritiesExtractor</span>(<span style="color: #6434A3;">OAuth2RestOperations</span> <span style="color: #BA36A5;">template</span>){
                        <span style="color: #0000FF;">this</span>.template= template;
                    }

                    <span style="color: #D0372D;">@Override</span>
                    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">GrantedAuthority</span>&gt; <span style="color: #006699;">extractAuthorities</span>(<span style="color: #6434A3;">Map</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Object</span>&gt; <span style="color: #BA36A5;">map</span>) {
                        <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">url</span> = (<span style="color: #6434A3;">String</span>) map.get(<span style="color: #008000;">"organizations_url"</span>);
                        System.err.println(<span style="color: #008000;">"url:"</span>+url);
                        <span style="color: #D0372D;">@SuppressWarnings</span>(<span style="color: #008000;">"unchecked"</span>)
                            <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">Map</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Object</span>&gt;&gt; <span style="color: #BA36A5;">orgs</span> = template.getForObject(url, List.<span style="color: #0000FF;">class</span>);
                        System.err.println(<span style="color: #008000;">"orgs:"</span>+orgs);
                        <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">Map</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">Object</span>&gt; <span style="color: #BA36A5;">org</span> : orgs) {
                            <span style="color: #0000FF;">if</span>(<span style="color: #008000;">"simplonco"</span>.equals(org.get(<span style="color: #008000;">"login"</span>))) {
                                <span style="color: #0000FF;">return</span> AuthorityUtils.commaSeparatedStringToAuthorityList(<span style="color: #008000;">"ROLE_USER, ROLE_ADMIN"</span>);
                            }
                        }
                        <span style="color: #0000FF;">return</span> AuthorityUtils.commaSeparatedStringToAuthorityList(<span style="color: #008000;">"ROLE_USER"</span>);
                        <span style="color: #8D8D84;">//      </span><span style="color: #8D8D84; font-style: italic;">throw new BadCredentialsException("Not in required organization");</span>

                    }
                }
</pre>
</div>
<p>
Tester l'accès à la ressource restreinte au rôle
d'administrateur. Éventuellement, créer une autre
organisation github, s'y inscrire et rendre publique
son appartenance à celle-ci. Modifier le code pour
qu'il utilise cette nouvelle organisation et tester
nouveau.
</p></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org7108f5d" class="outline-2">
<h2 id="org7108f5d"><span class="section-number-2">3</span> Mise en œuvre</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3e0b1d1" class="outline-3">
<h3 id="org3e0b1d1"><span class="section-number-3">3.1</span> Protections plus complexes au niveau des méthodes</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Tester les annotations <a href="http://www.baeldung.com/spring-security-method-security">@PreAuthorize et @PostAutorize</a>.
</p>
</div>
</div>
<div id="outline-container-org9b68658" class="outline-3">
<h3 id="org9b68658"><span class="section-number-3">3.2</span> CRUD</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Implémenter la sécurisation d'un CRUD
</p>
</div>
</div>
