session5/cours/Spring-Security-OAuth2.html
<div id="outline-container-org1b1b35e" class="outline-3">
<h3 id="org1b1b35e"><span class="section-number-3">3.3</span> Client Angular 6</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Implémenter la <a href="http://www.baeldung.com/spring-security-oauth-authorization-code-flow">sécurisation avec un client Angular 6</a>.
</p>

<p>
Pour la protection contre le <a href="https://fr.wikipedia.org/wiki/Cross-site_request_forgery">CSRF</a> à l'aide d'un token dans les
entêtes HTTP qui doit être ajouté par javascript, et qui empêche les
simples liens <a href="https://mysitesecuredwithcookies.com/send/myMoney">Vous avez gagné !!!!!</a> de marcher, on aurait pas gagné
grand chose s'il était possible à un adversaire (par exemple
<a href="https://evil.com">https://evil.com</a> ) d'envoyer du code javascript qui ferait lui aussi
l'ajout du token dans l'entête de la requête vers le site sécurisé.
C'est pour empêcher cela que les navigateurs implémentent le <a href="https://en.wikipedia.org/wiki/Same-origin_policy">Same
Origin Policy (SOP)</a> qui interdit à du code javascript chargé depuis un
serveur (e.g.<a href="https://evil.com">https://evil.com</a>) d'envoyer des requêtes vers un serveur
différent (e.g. <a href="https://my-secured-site.com">https://my-secured-site.com</a>).
</p>

<p>
Évidemment, cela poserait des problèmes non seulement pour
l'utilisation de web services, mais aussi pour le développement
d'applications Angular qui sont (en cours de développement) servies
par un serveur dédié (par exemple en <a href="http://localhost:4200">http://localhost:4200</a>) différent
du serveur backend (par exemple en <a href="http://localhost:8090">http://localhost:8090</a>).
</p>

<p>
La solution à ce problème est offerte par le mécanisme de <a href="https://en.wikipedia.org/wiki/Cross-origin_resource_sharing">Cross Origin
Resource Sharing (CORS)</a> qui permet à un serveur (par exemple le
backend en <a href="http://localhost:8090">http://localhost:8090</a>) d'indiquer aux navigateurs webs
quels autres serveurs (par exemple le serveur de développement angular
en <a href="http://localhost:4200">http://localhost:4200</a>)sont autorisés à envoyer du code javascript
qui pourra faire des requêtes qui lui sont destinées.
</p>

<p>
Avec Spring, il est <a href="https://spring.io/blog/2015/06/08/cors-support-in-spring-framework">facile d'activer le CORS</a> à différents niveaux de
granularité, comme pour les autres mécanismes d'autorisation.
</p>
</div>
</div>
</div>
<div id="outline-container-org06b48a2" class="outline-2">
<h2 id="org06b48a2"><span class="section-number-2">4</span> Pour aller plus loin</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9a09d50" class="outline-3">
<h3 id="org9a09d50"><span class="section-number-3">4.1</span> Content Security Policy</h3>
<div class="outline-text-3" id="text-4-1">
<p>
La protection en fonction de l'origine du code Javascript exécuté
offerte par Same Origin Policy peut aussi être étendue, notamment aux
bibliothèques Javascript utilisée. La standardisation des entêtes
définissant la <a href="https://en.wikipedia.org/wiki/Content_Security_Policy">Content Security Policy</a> permet de répondre à ces
besoins. Bien sûr, <a href="https://docs.spring.io/spring-security/site/docs/current/reference/html/headers.html">Spring Security permet de mettre en œuvre ces
protections</a>.
</p>
</div>
</div>

<div id="outline-container-org7fe7b5b" class="outline-3">
<h3 id="org7fe7b5b"><span class="section-number-3">4.2</span> SSL</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Aucune des autres protection ne pourra être efficace si l'attaquant
peut intercepter les communications (<a href="https://fr.wikipedia.org/wiki/Attaque_de_l%27homme_du_milieu">Man In the Middle</a>). Pour éviter
cela, il <b>faut</b> utiliser HTTPS (et donc un certificat SSL). Dans un
environnement <i>corporate</i>, cela sera pris en charge au niveau de
l'entreprise. Pour un projet personnel, on peut utiliser un certificat
délivré par <a href="https://letsencrypt.org/">Let's Encrypt</a>. Le processus <a href="https://github.com/creactiviti/spring-boot-starter-acme">peut être automatisé pour une
application Spring Boot</a>.
</p>
</div>
</div>


<div id="outline-container-orga7cc6b9" class="outline-3">
<h3 id="orga7cc6b9"><span class="section-number-3">4.3</span> OWASP</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Dans le domaine de la sécurité encore plus que tout autre, il est
indispensable de faire de la veille pour se tenir à jour des dernières
vulnérabilité / bonnes pratiques. La lecture régulières des documents
publiés par <a href="https://www.owasp.org/index.php/Main_Page">OWASP</a> (cf. <a href="https://www.owasp.org/index.php/REST_Security_Cheat_Sheet">sécurisation de REST</a>) est indispensable.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Bernard Hugueney</p>
<p class="date">Created: 2020-02-04 Tue 08:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
