session5/cours/Spring-Security-OAuth2.md


<a id="orgd2fa4a1"></a>

## Client Angular 6

Implémenter la [sécurisation avec un client Angular 6](http://www.baeldung.com/spring-security-oauth-authorization-code-flow).

Pour la protection contre le [CSRF](https://fr.wikipedia.org/wiki/Cross-site_request_forgery) à l'aide d'un token dans les entêtes HTTP qui doit être ajouté par javascript, et qui empêche les simples liens [Vous avez gagné !!!!!](https://mysitesecuredwithcookies.com/send/myMoney) de marcher, on aurait pas gagné grand chose s'il était possible à un adversaire (par exemple <https://evil.com> ) d'envoyer du code javascript qui ferait lui aussi l'ajout du token dans l'entête de la requête vers le site sécurisé. C'est pour empêcher cela que les navigateurs implémentent le [Same Origin Policy (SOP)](https://en.wikipedia.org/wiki/Same-origin_policy) qui interdit à du code javascript chargé depuis un serveur (e.g.<https://evil.com>) d'envoyer des requêtes vers un serveur différent (e.g. <https://my-secured-site.com>).

Évidemment, cela poserait des problèmes non seulement pour l'utilisation de web services, mais aussi pour le développement d'applications Angular qui sont (en cours de développement) servies par un serveur dédié (par exemple en <http://localhost:4200>) différent du serveur backend (par exemple en <http://localhost:8090>).

La solution à ce problème est offerte par le mécanisme de [Cross Origin Resource Sharing (CORS)](https://en.wikipedia.org/wiki/Cross-origin_resource_sharing) qui permet à un serveur (par exemple le backend en <http://localhost:8090>) d'indiquer aux navigateurs webs quels autres serveurs (par exemple le serveur de développement angular en <http://localhost:4200>)sont autorisés à envoyer du code javascript qui pourra faire des requêtes qui lui sont destinées.

Avec Spring, il est [facile d'activer le CORS](https://spring.io/blog/2015/06/08/cors-support-in-spring-framework) à différents niveaux de granularité, comme pour les autres mécanismes d'autorisation.


<a id="orgdf8dbe2"></a>

# Pour aller plus loin


<a id="org118a271"></a>

## Content Security Policy

La protection en fonction de l'origine du code Javascript exécuté offerte par Same Origin Policy peut aussi être étendue, notamment aux bibliothèques Javascript utilisée. La standardisation des entêtes définissant la [Content Security Policy](https://en.wikipedia.org/wiki/Content_Security_Policy) permet de répondre à ces besoins. Bien sûr, [Spring Security permet de mettre en œuvre ces protections](https://docs.spring.io/spring-security/site/docs/current/reference/html/headers.html).


<a id="org00c2469"></a>

## SSL

Aucune des autres protection ne pourra être efficace si l'attaquant peut intercepter les communications ([Man In the Middle](https://fr.wikipedia.org/wiki/Attaque_de_l%27homme_du_milieu)). Pour éviter cela, il **faut** utiliser HTTPS (et donc un certificat SSL). Dans un environnement *corporate*, cela sera pris en charge au niveau de l'entreprise. Pour un projet personnel, on peut utiliser un certificat délivré par [Let's Encrypt](https://letsencrypt.org/). Le processus [peut être automatisé pour une application Spring Boot](https://github.com/creactiviti/spring-boot-starter-acme).


<a id="orgffef12b"></a>

## OWASP

Dans le domaine de la sécurité encore plus que tout autre, il est indispensable de faire de la veille pour se tenir à jour des dernières vulnérabilité / bonnes pratiques. La lecture régulières des documents publiés par [OWASP](https://www.owasp.org/index.php/Main_Page) (cf. [sécurisation de REST](https://www.owasp.org/index.php/REST_Security_Cheat_Sheet)) est indispensable.
